log/nginx-500.log
Start web server....
docker run -d --name=web -v `pwd`/data:/usr/share/nginx/html -v `pwd`/dockerfile/nginx/nginx.conf:/etc/nginx/nginx.conf -p 80:80 nginx 
55661f8c4f6317359771af2c29c175d2eba37f365a60fd50e3338258b26e926b

Fire vegeta....
echo "GET http://localhost/pic.png" | vegeta attack -duration=60s -rate 500  | tee results.bin | vegeta report
Requests      [total, rate]            30000, 500.02
Duration      [total, attack, wait]    59.999678s, 59.997999s, 1.679ms
Latencies     [mean, 50, 95, 99, max]  2.31921ms, 1.573ms, 4.681ms, 22.049ms, 80.977ms
Bytes In      [total, mean]            270990000, 9033.00
Bytes Out     [total, mean]            0, 0.00
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:30000  
Error Set:

Kill web server....
docker rm -f web
web