log/nginx-500.log
Start web server....
docker run -d --name=web -v `pwd`/nginx-log:/log -p 80:80 -p 7890:7890 peihsinsu/nginx 
feac12d24d93325f71b38047687334eb0ed5184528cbc25190327281a151646d

Fire vegeta....
echo "GET http://localhost/pic.png" | vegeta attack -duration=30s -rate 500  | tee results.bin | vegeta report
Requests      [total, rate]            15000, 500.03
Duration      [total, attack, wait]    29.998887s, 29.997999s, 888µs
Latencies     [mean, 50, 95, 99, max]  1.03871ms, 983µs, 1.192ms, 1.904ms, 34.589ms
Bytes In      [total, mean]            135495000, 9033.00
Bytes Out     [total, mean]            0, 0.00
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:15000  
Error Set:

Kill web server....
docker rm -f web
web